n2g.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-21 Thu 00:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>N2G</title>
<meta name="author" content="Rostislav Svoboda" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">N2G</h1>

<div id="outline-container-orgfe6641b" class="outline-2">
<h2 id="orgfe6641b"><span class="section-number-2">1.</span> Normalizing</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Define:
<ul class="org-ul">
<li>lists of packages \(N\) and \(G\) available for Nix and Guix.</li>
<li>functions \(f_N\) and \(f_G\) for normalizing package names for Nix and Guix.</li>
</ul></li>

<li>Normalize the package names of both lists \(N\), \(G\) and turn the normalized
lists into Sets:
\[ N_{nrm} = \Set{ f_N(N) } \]
\[ G_{nrm} = \Set{ f_G(G) } \]</li>

<li>Find the intersection \(I\) of the sets \(N_n\) and \(G_n\) (omitting the
subscript \(_{nrm}\) at \(I\)):
\[ I = N_{nrm} \cap G_{nrm} \]
The intersection contains normalized names of packages existing in both
operating systems.</li>
</ul>
</div>
</div>

<div id="outline-container-org04bc7b3" class="outline-2">
<h2 id="org04bc7b3"><span class="section-number-2">2.</span> Ordering &amp; package complexity</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Define ordering relations \(\leq_N\) and \(\leq_G\) for package definition
complexity for Nix and Guix.
The more complex a package definition is the higher complexity index the it
has.</li>

<li><p>
Order the intersection or normalized names \(I\) by \(\leq_N\) and \(\leq_G\):
\[ I_{\leq_N} = (I, \leq_N) \]
\[ I_{\leq_G} = (I, \leq_G) \]
Every item of the intersection \(p \in I\) is assigned two indexes
corresponding to its positions in the Ordered Sets \(I_{\leq_N}\),
\(I_{\leq_G}\), i.e.:
</p>

<ul class="org-ul">
<li>\(\forall p_N \in I : p_{ciN}\), i.e. every package existing in both OS's
has some <b>basic</b> complexity level \(p_{ciN}\) in Nix where \(i \in \{0,1,
    ... \}\).</li>
<li>\(\forall p_G \in I : p_{ciG}\) i.e. every package existing in both OS's has
some <b>basic</b> complexity level \(p_{ciG}\) in Guix where \(i \in \{0,1,
    ... \}\).</li>
</ul>
<p>
However the basic complexity levels in Nix and Guix are independent from
each other. I.e. they must be further <b>normalized</b>. I.e. some mapping
between them (e.g. grouping of the basic levels) must be defined so that the
normalized complexity levels correspond to each other.
</p></li>

<li>For every package \(p \in I\) compute complexity distance
\[ d_p = \|p_{cN} - p_{cG}\| \]
where
\[ p_{cN} \in I_{\leq_N} \]
\[ p_{cG} \in I_{\leq_G} \]</li>

<li><p>
For every level of complexity, select packages from \(I\) as follows:
</p>
<ul class="org-ul">
<li>For \(p_{c_0}\) - packages with complexity level 0:
\[ I_{c_0d_0} = \{ p_{c_0} \in I : d_p = 0\} \]</li>
<li>For \(p_{c_1}\) - packages with complexity level 1:
\[ I_{c_1d_0} = \{ p_{c_1} \in I : d_p = 0\} \]</li>
<li>&#x2026;</li>
<li>For \(p_{c_n}\) - packages with complexity level N:
\[ I_{c_nd_0} = \{ p_{c_N} \in I : d_p = 0\} \]</li>
</ul>
<p>
I.e. the complexity distance is 0 for every complexity level
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org9c4fcb5" class="outline-2">
<h2 id="org9c4fcb5"><span class="section-number-2">3.</span> Conversion</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Convert the \(I_{c_0d_0}, I_{c_1d_0}, ... I_{c_nd_0}\) packages.
This transformation / translation should be relatively simple.</li>
<li>Convert the packages which definitions complexity significantly differs between the
operating systems.
<ul class="org-ul">
<li>Simple on Nix (low \(_{c}\) index), complex on Guix (high \(_{c}\) index)</li>
<li>Complex on Nix (high \(_{c}\) index), simple on Guix (low \(_{c}\) index)</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orgd3e9114" class="outline-3">
<h3 id="orgd3e9114"><span class="section-number-3">3.1.</span> NN training</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>find, i.e. ask which is the appropriate NN type?</li>
<li>split to train and test data.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: December 21, 2023</p>
<p class="author">Author: Rostislav Svoboda</p>
<p class="date">Created: 2023-12-21 Thu 00:11</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
